podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMAMUX0_32CH_TRIG_SPLIT_MK82F15.svd.xml
            <register>
               <dim>16</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>CHCFG_HIGH%s</name>
               <description>Channel Configuration Register (High)</description>
               <addressOffset>0x10</addressOffset>
               <size>8</size>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SOURCE</name>
                     <description>DMA Channel Source (slot)\n
Specifies which DMA source, if any, is routed to a particular DMA channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>Disabled</name>
                           <description>Disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO_Shifter0</name>
                           <description>FlexIO Shifter 0</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO_Shifter1</name>
                           <description>FlexIO Shifter 1</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO_Shifter2</name>
                           <description>FlexIO Shifter 2</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO_Shifter3</name>
                           <description>FlexIO Shifter 3</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO_Shifter4</name>
                           <description>FlexIO Shifter 4</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO_Shifter5</name>
                           <description>FlexIO Shifter 5</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO_Shifter6</name>
                           <description>FlexIO Shifter 6</description>
                           <value>7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FlexIO_Shifter7</name>
                           <description>FlexIO Shifter 7</description>
                           <value>8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved9</name>
                           <description>Reserved</description>
                           <value>9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved10</name>
                           <description>Reserved</description>
                           <value>10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved11</name>
                           <description>Reserved</description>
                           <value>11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved12</name>
                           <description>Reserved</description>
                           <value>12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved13</name>
                           <description>Reserved</description>
                           <value>13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved14</name>
                           <description>Reserved</description>
                           <value>14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved15</name>
                           <description>Reserved</description>
                           <value>15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved16</name>
                           <description>Reserved</description>
                           <value>16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LTC0_InFIFO</name>
                           <description>LTC0 InFIFO</description>
                           <value>17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LTC0_OutFIFO</name>
                           <description>LTC0 OutFIFO</description>
                           <value>18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LTC0_PKHA_RAM_Read</name>
                           <description>LTC0 PKHA RAM Read</description>
                           <value>19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMVSIM0_Rx</name>
                           <description>EMVSIM0 Receive</description>
                           <value>20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMVSIM0_Tx</name>
                           <description>EMVSIM0 Transmit</description>
                           <value>21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMVSIM1_Rx</name>
                           <description>EMVSIM1 Receive</description>
                           <value>22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EMVSIM1_Tx</name>
                           <description>EMVSIM1 Transmit</description>
                           <value>23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QSPI0_Rx</name>
                           <description>QSPI0 Receive</description>
                           <value>24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>QSPI0_Tx</name>
                           <description>QSPI0 Transmit</description>
                           <value>25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved26</name>
                           <description>Reserved</description>
                           <value>26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved27</name>
                           <description>Reserved</description>
                           <value>27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI0_Rx</name>
                           <description>SPI0 Receive</description>
                           <value>28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI0_Tx</name>
                           <description>SPI0 Transmit</description>
                           <value>29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI1_Rx</name>
                           <description>SPI1 Receive</description>
                           <value>30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI1_Tx</name>
                           <description>SPI1 Transmit</description>
                           <value>31</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved32</name>
                           <description>Reserved</description>
                           <value>32</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved33</name>
                           <description>Reserved</description>
                           <value>33</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved34</name>
                           <description>Reserved</description>
                           <value>34</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved35</name>
                           <description>Reserved</description>
                           <value>35</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved36</name>
                           <description>Reserved</description>
                           <value>36</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved37</name>
                           <description>Reserved</description>
                           <value>37</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved38</name>
                           <description>Reserved</description>
                           <value>38</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved39</name>
                           <description>Reserved</description>
                           <value>39</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved40</name>
                           <description>Reserved</description>
                           <value>40</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved41</name>
                           <description>Reserved</description>
                           <value>41</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM1_Ch0</name>
                           <description>TPM1 Channel 0</description>
                           <value>42</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM1_Ch1</name>
                           <description>TPM1 Channel 1</description>
                           <value>43</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM2_Ch0</name>
                           <description>TPM2 Channel 0</description>
                           <value>44</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM2_Ch1</name>
                           <description>TPM2 Channel 1</description>
                           <value>45</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved46</name>
                           <description>Reserved</description>
                           <value>46</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved47</name>
                           <description>Reserved</description>
                           <value>47</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved48</name>
                           <description>Reserved</description>
                           <value>48</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved49</name>
                           <description>Reserved</description>
                           <value>49</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved50</name>
                           <description>Reserved</description>
                           <value>50</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved51</name>
                           <description>Reserved</description>
                           <value>51</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved52</name>
                           <description>Reserved</description>
                           <value>52</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved53</name>
                           <description>Reserved</description>
                           <value>53</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved54</name>
                           <description>Reserved</description>
                           <value>54</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM1_Overflow</name>
                           <description>TPM1 Overflow</description>
                           <value>55</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TPM2_Overflow</name>
                           <description>TPM2 Overflow</description>
                           <value>56</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>Reserved57</name>
                           <description>Reserved</description>
                           <value>57</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI3_Rx</name>
                           <description>SPI3 Receive</description>
                           <value>58</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI3_Tx</name>
                           <description>SPI3 Transmit</description>
                           <value>59</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled60</name>
                           <description>AlwaysEnabled60</description>
                           <value>60</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled61</name>
                           <description>AlwaysEnabled61</description>
                           <value>61</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled62</name>
                           <description>AlwaysEnabled62</description>
                           <value>62</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AlwaysEnabled63</name>
                           <description>AlwaysEnabled63</description>
                           <value>63</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIG</name>
                     <description>DMA Channel Trigger Enable\n
Enables the periodic trigger capability for the triggered DMA channel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Request directly routed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Periodic triggering enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENBL</name>
                     <description>DMA Channel Enable\n
Usually the Channel enable in the DMA is used in preference to this</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Channel disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Channel enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
